openxc/vi-firmware/src/libs/CDL/LPC177x_8xLib/inc/lpc177x_8x_qei.h
/**********************************************************************
* $Id$		lpc177x_8x_qei.h			2011-06-02
*//**
* @file		lpc177x_8x_qei.h
* @brief	Contains all macro definitions and function prototypes
*			support for QEI firmware library on LPC177x_8x
* @version	1.0
* @date		02. June. 2011
* @author	NXP MCU SW Application Team
* 
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors'
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.
**********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @defgroup QEI QEI (Quadrature Encoder Interface)
 * @ingroup LPC177x_8xCMSIS_FwLib_Drivers
 * @{
 */

#ifndef __LPC17X_8X_QEI_H_
#define __LPC17X_8X_QEI_H_

/* Includes ------------------------------------------------------------------- */
#include "LPC177x_8x.h"
#include "lpc_types.h"


#ifdef __cplusplus
extern "C"
{
#endif

/* Public Macros -------------------------------------------------------------- */
/** @defgroup QEI_Public_Macros QEI Public Macros
 * @{
 */

#define QEI_0					(0)

/* QEI Reset types */
/** QEI Reset types - Reset position counter */
#define QEI_RESET_POS			QEI_CON_RESP
/** QEI Reset types - Reset Posistion Counter on Index */
#define QEI_RESET_POSOnIDX		QEI_CON_RESPI
/** QEI Reset types - Reset Velocity */
#define QEI_RESET_VEL			QEI_CON_RESV
/** QEI Reset types - Reset Index Counter */
#define QEI_RESET_IDX			QEI_CON_RESI

/* QEI Direction Invert Type Option */
/** QEI Direction Invert Type Option - Direction is not inverted */
#define QEI_DIRINV_NONE		((uint32_t)(0))
/** QEI Direction Invert Type Option - Direction is complemented */
#define QEI_DIRINV_CMPL		((uint32_t)(1))

/* QEI Signal Mode Option */
/** Signal operation: Quadrature phase mode */
#define QEI_SIGNALMODE_QUAD		((uint32_t)(0))
/** Signal operation: Clock/Direction mode */
#define QEI_SIGNALMODE_CLKDIR	((uint32_t)(1))

/* QEI Capture Mode Option */
/** Capture mode: Only Phase-A edges are counted (2X) */
#define QEI_CAPMODE_2X			((uint32_t)(0))
/** Capture mode: BOTH PhA and PhB edges are counted (4X)*/
#define QEI_CAPMODE_4X			((uint32_t)(1))

/* QEI Invert Index Signal Option */
/** Invert Index signal option: None */
#define QEI_INVINX_NONE			((uint32_t)(0))
/** Invert Index signal option: Enable */
#define QEI_INVINX_EN			((uint32_t)(1))

/* QEI timer reload option */
/** Reload value in absolute value */
#define QEI_TIMERRELOAD_TICKVAL	((uint8_t)(0))
/** Reload value in microsecond value */
#define QEI_TIMERRELOAD_USVAL	((uint8_t)(1))

/* QEI Flag Status type */
/** Direction status */
#define QEI_STATUS_DIR			((uint32_t)(1<<0))

/* QEI Compare Position channel option */
/** QEI compare position channel 0 */
#define QEI_COMPPOS_CH_0			((uint8_t)(0))
/** QEI compare position channel 1 */
#define QEI_COMPPOS_CH_1			((uint8_t)(1))
/** QEI compare position channel 2 */
#define QEI_COMPPOS_CH_2			((uint8_t)(2))

/* QEI interrupt flag type */
/** index pulse was detected interrupt */
#define QEI_INTFLAG_INX_Int			((uint32_t)(1<<0))
/** Velocity timer over flow interrupt */
#define QEI_INTFLAG_TIM_Int			((uint32_t)(1<<1))
/** Capture velocity is less than compare interrupt */
#define QEI_INTFLAG_VELC_Int		((uint32_t)(1<<2))
/** Change of direction interrupt */
#define QEI_INTFLAG_DIR_Int			((uint32_t)(1<<3))
/** An encoder phase error interrupt */
#define QEI_INTFLAG_ERR_Int			((uint32_t)(1<<4))
/** An encoder clock pulse was detected interrupt */
#define QEI_INTFLAG_ENCLK_Int		((uint32_t)(1<<5))
/** position 0 compare value is equal to the current position interrupt */
#define QEI_INTFLAG_POS0_Int		((uint32_t)(1<<6))
/** position 1 compare value is equal to the current position interrupt */
#define QEI_INTFLAG_POS1_Int		((uint32_t)(1<<7))
/** position 2 compare value is equal to the current position interrupt */
#define QEI_INTFLAG_POS2_Int		((uint32_t)(1<<8))
/** Index compare value is equal to the current index count interrupt */
#define QEI_INTFLAG_REV_Int			((uint32_t)(1<<9))
/** Combined position 0 and revolution count interrupt */
#define QEI_INTFLAG_POS0REV_Int		((uint32_t)(1<<10))
/** Combined position 1 and revolution count interrupt */
#define QEI_INTFLAG_POS1REV_Int		((uint32_t)(1<<11))
/** Combined position 2 and revolution count interrupt */
#define QEI_INTFLAG_POS2REV_Int		((uint32_t)(1<<12))

/**
 * @}
 */


/* Private Macros ------------------------------------------------------------- */
/** @defgroup QEI_Private_Macros QEI Private Macros
 * @{
 */

/* --------------------- BIT DEFINITIONS -------------------------------------- */
/* Quadrature Encoder Interface Control Register Definition --------------------- */
/*********************************************************************//**
 * Macro defines for QEI Control register
 **********************************************************************/
/** Reset position counter */
#define QEI_CON_RESP		((uint32_t)(1<<0))
/** Reset Posistion Counter on Index */
#define QEI_CON_RESPI		((uint32_t)(1<<1))
/** Reset Velocity */
#define QEI_CON_RESV		((uint32_t)(1<<2))
/** Reset Index Counter */
#define QEI_CON_RESI		((uint32_t)(1<<3))
/** QEI Control register bit-mask */
#define QEI_CON_BITMASK		((uint32_t)(0x0F))

/*********************************************************************//**
 * Macro defines for QEI Configuration register
 **********************************************************************/
/** Direction Invert */
#define QEI_CONF_DIRINV		((uint32_t)(1<<0))
/** Signal mode */
#define QEI_CONF_SIGMODE	((uint32_t)(1<<1))
/** Capture mode */
#define QEI_CONF_CAPMODE	((uint32_t)(1<<2))
/** Invert index */
#define QEI_CONF_INVINX		((uint32_t)(1<<3))
/** QEI Configuration register bit-mask */
#define QEI_CONF_BITMASK	((uint32_t)(0x0F))

/*********************************************************************//**
 * Macro defines for QEI Status register
 **********************************************************************/
/** Direction bit */
#define QEI_STAT_DIR		((uint32_t)(1<<0))
/** QEI status register bit-mask */
#define QEI_STAT_BITMASK	((uint32_t)(1<<0))

/* Quadrature Encoder Interface Interrupt registers definitions --------------------- */
/*********************************************************************//**
 * Macro defines for QEI Interrupt Status register
 **********************************************************************/
/** Indicates that an index pulse was detected */
#define QEI_INTSTAT_INX_Int			((uint32_t)(1<<0))
/** Indicates that a velocity timer overflow occurred */
#define QEI_INTSTAT_TIM_Int			((uint32_t)(1<<1))
/** Indicates that capture velocity is less than compare velocity */
#define QEI_INTSTAT_VELC_Int		((uint32_t)(1<<2))
/** Indicates that a change of direction was detected */
#define QEI_INTSTAT_DIR_Int			((uint32_t)(1<<3))
/** Indicates that an encoder phase error was detected */
#define QEI_INTSTAT_ERR_Int			((uint32_t)(1<<4))
/** Indicates that and encoder clock pulse was detected */
#define QEI_INTSTAT_ENCLK_Int		((uint32_t)(1<<5))
/** Indicates that the position 0 compare value is equal to the current position */
#define QEI_INTSTAT_POS0_Int		((uint32_t)(1<<6))
/** Indicates that the position 1compare value is equal to the current position */
#define QEI_INTSTAT_POS1_Int		((uint32_t)(1<<7))
/** Indicates that the position 2 compare value is equal to the current position */
#define QEI_INTSTAT_POS2_Int		((uint32_t)(1<<8))
/** Indicates that the index compare value is equal to the current index count */
#define QEI_INTSTAT_REV_Int			((uint32_t)(1<<9))
/** Combined position 0 and revolution count interrupt. Set when
* both the POS0_Int bit is set and the REV_Int is set */
#define QEI_INTSTAT_POS0REV_Int		((uint32_t)(1<<10))
/** Combined position 1 and revolution count interrupt. Set when
both the POS1_Int bit is set and the REV_Int is set */
#define QEI_INTSTAT_POS1REV_Int		((uint32_t)(1<<11))
/** Combined position 2 and revolution count interrupt. Set when
both the POS2_Int bit is set and the REV_Int is set */
#define QEI_INTSTAT_POS2REV_Int		((uint32_t)(1<<12))
/** QEI Interrupt Status register bit-mask */
#define QEI_INTSTAT_BITMASK			((uint32_t)(0x1FFF))

/*********************************************************************//**
 * Macro defines for QEI Interrupt Set register
 **********************************************************************/
/** Set Bit Indicates that an index pulse was detected */
#define QEI_INTSET_INX_Int			((uint32_t)(1<<0))
/** Set Bit Indicates that a velocity timer overflow occurred */
#define QEI_INTSET_TIM_Int			((uint32_t)(1<<1))
/** Set Bit Indicates that capture velocity is less than compare velocity */
#define QEI_INTSET_VELC_Int			((uint32_t)(1<<2))
/** Set Bit Indicates that a change of direction was detected */
#define QEI_INTSET_DIR_Int			((uint32_t)(1<<3))
/** Set Bit Indicates that an encoder phase error was detected */
#define QEI_INTSET_ERR_Int			((uint32_t)(1<<4))
/** Set Bit Indicates that and encoder clock pulse was detected */
#define QEI_INTSET_ENCLK_Int		((uint32_t)(1<<5))
/** Set Bit Indicates that the position 0 compare value is equal to the current position */
#define QEI_INTSET_POS0_Int			((uint32_t)(1<<6))
/** Set Bit Indicates that the position 1compare value is equal to the current position */
#define QEI_INTSET_POS1_Int			((uint32_t)(1<<7))
/** Set Bit Indicates that the position 2 compare value is equal to the current position */
#define QEI_INTSET_POS2_Int			((uint32_t)(1<<8))
/** Set Bit Indicates that the index compare value is equal to the current index count */
#define QEI_INTSET_REV_Int			((uint32_t)(1<<9))
/** Set Bit that combined position 0 and revolution count interrupt */
#define QEI_INTSET_POS0REV_Int		((uint32_t)(1<<10))
/** Set Bit that Combined position 1 and revolution count interrupt */
#define QEI_INTSET_POS1REV_Int		((uint32_t)(1<<11))
/** Set Bit that Combined position 2 and revolution count interrupt */
#define QEI_INTSET_POS2REV_Int		((uint32_t)(1<<12))
/** QEI Interrupt Set register bit-mask */
#define QEI_INTSET_BITMASK			((uint32_t)(0x1FFF))

/*********************************************************************//**
 * Macro defines for QEI Interrupt Clear register
 **********************************************************************/
/** Clear Bit Indicates that an index pulse was detected */
#define QEI_INTCLR_INX_Int			((uint32_t)(1<<0))
/** Clear Bit Indicates that a velocity timer overflow occurred */
#define QEI_INTCLR_TIM_Int			((uint32_t)(1<<1))
/** Clear Bit Indicates that capture velocity is less than compare velocity */
#define QEI_INTCLR_VELC_Int			((uint32_t)(1<<2))
/** Clear Bit Indicates that a change of direction was detected */
#define QEI_INTCLR_DIR_Int			((uint32_t)(1<<3))
/** Clear Bit Indicates that an encoder phase error was detected */
#define QEI_INTCLR_ERR_Int			((uint32_t)(1<<4))
/** Clear Bit Indicates that and encoder clock pulse was detected */
#define QEI_INTCLR_ENCLK_Int		((uint32_t)(1<<5))
/** Clear Bit Indicates that the position 0 compare value is equal to the current position */
#define QEI_INTCLR_POS0_Int			((uint32_t)(1<<6))
/** Clear Bit Indicates that the position 1compare value is equal to the current position */
#define QEI_INTCLR_POS1_Int			((uint32_t)(1<<7))
/** Clear Bit Indicates that the position 2 compare value is equal to the current position */
#define QEI_INTCLR_POS2_Int			((uint32_t)(1<<8))
/** Clear Bit Indicates that the index compare value is equal to the current index count */
#define QEI_INTCLR_REV_Int			((uint32_t)(1<<9))
/** Clear Bit that combined position 0 and revolution count interrupt */
#define QEI_INTCLR_POS0REV_Int		((uint32_t)(1<<10))
/** Clear Bit that Combined position 1 and revolution count interrupt */
#define QEI_INTCLR_POS1REV_Int		((uint32_t)(1<<11))
/** Clear Bit that Combined position 2 and revolution count interrupt */
#define QEI_INTCLR_POS2REV_Int		((uint32_t)(1<<12))
/** QEI Interrupt Clear register bit-mask */
#define QEI_INTCLR_BITMASK			((uint32_t)(0xFFFF))

/*********************************************************************//**
 * Macro defines for QEI Interrupt Enable register
 **********************************************************************/
/** Enabled Interrupt Bit Indicates that an index pulse was detected */
#define QEI_INTEN_INX_Int			((uint32_t)(1<<0))
/** Enabled Interrupt Bit Indicates that a velocity timer overflow occurred */
#define QEI_INTEN_TIM_Int			((uint32_t)(1<<1))
/** Enabled Interrupt Bit Indicates that capture velocity is less than compare velocity */
#define QEI_INTEN_VELC_Int			((uint32_t)(1<<2))
/** Enabled Interrupt Bit Indicates that a change of direction was detected */
#define QEI_INTEN_DIR_Int			((uint32_t)(1<<3))
/** Enabled Interrupt Bit Indicates that an encoder phase error was detected */
#define QEI_INTEN_ERR_Int			((uint32_t)(1<<4))
/** Enabled Interrupt Bit Indicates that and encoder clock pulse was detected */
#define QEI_INTEN_ENCLK_Int			((uint32_t)(1<<5))
/** Enabled Interrupt Bit Indicates that the position 0 compare value is equal to the current position */
#define QEI_INTEN_POS0_Int			((uint32_t)(1<<6))
/** Enabled Interrupt Bit Indicates that the position 1compare value is equal to the current position */
#define QEI_INTEN_POS1_Int			((uint32_t)(1<<7))
/** Enabled Interrupt Bit Indicates that the position 2 compare value is equal to the current position */
#define QEI_INTEN_POS2_Int			((uint32_t)(1<<8))
/** Enabled Interrupt Bit Indicates that the index compare value is equal to the current index count */
#define QEI_INTEN_REV_Int			((uint32_t)(1<<9))
/** Enabled Interrupt Bit that combined position 0 and revolution count interrupt */
#define QEI_INTEN_POS0REV_Int		((uint32_t)(1<<10))
/** Enabled Interrupt Bit that Combined position 1 and revolution count interrupt */
#define QEI_INTEN_POS1REV_Int		((uint32_t)(1<<11))
/** Enabled Interrupt Bit that Combined position 2 and revolution count interrupt */
#define QEI_INTEN_POS2REV_Int		((uint32_t)(1<<12))
/** QEI Interrupt Enable register bit-mask */
#define QEI_INTEN_BITMASK			((uint32_t)(0x1FFF))

/*********************************************************************//**
 * Macro defines for QEI Interrupt Enable Set register
 **********************************************************************/
/** Set Enable Interrupt Bit Indicates that an index pulse was detected */
#define QEI_IESET_INX_Int			((uint32_t)(1<<0))
/** Set Enable Interrupt Bit Indicates that a velocity timer overflow occurred */
#define QEI_IESET_TIM_Int			((uint32_t)(1<<1))
/** Set Enable Interrupt Bit Indicates that capture velocity is less than compare velocity */
#define QEI_IESET_VELC_Int			((uint32_t)(1<<2))
/** Set Enable Interrupt Bit Indicates that a change of direction was detected */
#define QEI_IESET_DIR_Int			((uint32_t)(1<<3))
/** Set Enable Interrupt Bit Indicates that an encoder phase error was detected */
#define QEI_IESET_ERR_Int			((uint32_t)(1<<4))
/** Set Enable Interrupt Bit Indicates that and encoder clock pulse was detected */
#define QEI_IESET_ENCLK_Int			((uint32_t)(1<<5))
/** Set Enable Interrupt Bit Indicates that the position 0 compare value is equal to 
* the current position */
#define QEI_IESET_POS0_Int			((uint32_t)(1<<6))
/** Set Enable Interrupt Bit Indicates that the position 1compare value is equal to 
* the current position */
#define QEI_IESET_POS1_Int			((uint32_t)(1<<7))
/** Set Enable Interrupt Bit Indicates that the position 2 compare value is equal to 
* the current position */
#define QEI_IESET_POS2_Int			((uint32_t)(1<<8))
/** Set Enable Interrupt Bit Indicates that the index compare value is equal to the 
* current index count */
#define QEI_IESET_REV_Int			((uint32_t)(1<<9))
/** Set Enable Interrupt Bit that combined position 0 and revolution count interrupt */
#define QEI_IESET_POS0REV_Int		((uint32_t)(1<<10))
/** Set Enable Interrupt Bit that Combined position 1 and revolution count interrupt */
#define QEI_IESET_POS1REV_Int		((uint32_t)(1<<11))
/** Set Enable Interrupt Bit that Combined position 2 and revolution count interrupt */
#define QEI_IESET_POS2REV_Int		((uint32_t)(1<<12))
/** QEI Interrupt Enable Set register bit-mask */
#define QEI_IESET_BITMASK			((uint32_t)(0x1FFF))

/*********************************************************************//**
 * Macro defines for QEI Interrupt Enable Clear register
 **********************************************************************/
/** Clear Enabled Interrupt Bit Indicates that an index pulse was detected */
#define QEI_IECLR_INX_Int			((uint32_t)(1<<0))
/** Clear Enabled Interrupt Bit Indicates that a velocity timer overflow occurred */
#define QEI_IECLR_TIM_Int			((uint32_t)(1<<1))
/** Clear Enabled Interrupt Bit Indicates that capture velocity is less than compare velocity */
#define QEI_IECLR_VELC_Int			((uint32_t)(1<<2))
/** Clear Enabled Interrupt Bit Indicates that a change of direction was detected */
#define QEI_IECLR_DIR_Int			((uint32_t)(1<<3))
/** Clear Enabled Interrupt Bit Indicates that an encoder phase error was detected */
#define QEI_IECLR_ERR_Int			((uint32_t)(1<<4))
/** Clear Enabled Interrupt Bit Indicates that and encoder clock pulse was detected */
#define QEI_IECLR_ENCLK_Int			((uint32_t)(1<<5))
/** Clear Enabled Interrupt Bit Indicates that the position 0 compare value is equal to the
* current position */
#define QEI_IECLR_POS0_Int			((uint32_t)(1<<6))
/** Clear Enabled Interrupt Bit Indicates that the position 1compare value is equal to the
* current position */
#define QEI_IECLR_POS1_Int			((uint32_t)(1<<7))
/** Clear Enabled Interrupt Bit Indicates that the position 2 compare value is equal to the
* current position */
#define QEI_IECLR_POS2_Int			((uint32_t)(1<<8))
/** Clear Enabled Interrupt Bit Indicates that the index compare value is equal to the current
* index count */
#define QEI_IECLR_REV_Int			((uint32_t)(1<<9))
/** Clear Enabled Interrupt Bit that combined position 0 and revolution count interrupt */
#define QEI_IECLR_POS0REV_Int		((uint32_t)(1<<10))
/** Clear Enabled Interrupt Bit that Combined position 1 and revolution count interrupt */
#define QEI_IECLR_POS1REV_Int		((uint32_t)(1<<11))
/** Clear Enabled Interrupt Bit that Combined position 2 and revolution count interrupt */
#define QEI_IECLR_POS2REV_Int		((uint32_t)(1<<12))
/** QEI Interrupt Enable Clear register bit-mask */
#define QEI_IECLR_BITMASK			((uint32_t)(0xFFFF))


/* ---------------- CHECK PARAMETER DEFINITIONS ---------------------------- */
/* Macro check QEI peripheral */
#define PARAM_QEIx(n)	((n==LPC_QEI))

/* Macro check QEI reset type */
#define PARAM_QEI_RESET(n)	((n==QEI_CON_RESP) \
									|| (n==QEI_RESET_POSOnIDX) \
									|| (n==QEI_RESET_VEL) \
									|| (n==QEI_RESET_IDX))

